<p>&nbsp;<iframe src="//www.youtube.com/embed/pr_1Ia1_Gs4" width="560" height="314" allowfullscreen="allowfullscreen"></iframe></p>
<p>&nbsp;</p>
<p>El Segundo&nbsp;<strong>libro que hemos elegido incluir en esta&nbsp;<a href="https://producthackers.com/es/articulos/nature-software-development/">serie de rese&ntilde;as</a>&nbsp;es&nbsp;<em>The Pragmatic Programmer</em>,</strong>&nbsp;de&nbsp;<em>Dave Thomas y Andrew Hunt</em>. Aunque no lo hayas le&iacute;do, seguramente tengas referencias sobre &eacute;l. Se trata de una de las obras que m&aacute;s he o&iacute;do recomendar entre desarrolladores desde que se editara hace ya veinte a&ntilde;os. Con motivo de este aniversario, de hecho, se ha lanzado una edici&oacute;n revisada. Es esta la que comentaremos aqu&iacute;.</p>
<p><strong><em>The Pragmatic Programmer</em>&nbsp;es un texto diverso sobre los diferentes aspectos del desarrollo de software</strong>&nbsp;que, en opini&oacute;n de los autores, deben considerarse para ser un buen programador. A lo largo de nueve cap&iacute;tulos, se nos presentan diferentes componentes de la disciplina, desde la filosof&iacute;a que debe adoptar el programador pragm&aacute;tico hasta cuestiones t&eacute;cnicas como la concurrencia. El nivel de abstracci&oacute;n presentado var&iacute;a seg&uacute;n el tema, de manera que&nbsp;<strong>en algunas secciones encontramos ejemplos de c&oacute;digo o herramientas concretas, mientras que otras se centran en la reflexi&oacute;n</strong>&nbsp;sobre cuestiones de m&aacute;s alto nivel.</p>
<p>&nbsp;</p>
<h2 class="wp-block-heading">El programador pragm&aacute;tico</h2>
<p>Pero,&nbsp;<strong>&iquest;qu&eacute; es un programador pragm&aacute;tico?</strong>&nbsp;En esencia, se trata de un profesional que se preocupa por hacer bien su trabajo. Esto es f&aacute;cil enunciarlo como principio, otra cosa es llevarlo a la pr&aacute;ctica de manera efectiva. El programador pragm&aacute;tico, en primera instancia, toma&nbsp;<strong>responsabilidad</strong>&nbsp;sobre lo que hace, mantiene la&nbsp;<strong>entrop&iacute;a del software bajo control</strong>, desarrolla&nbsp;<strong>&uacute;nicamente lo necesario</strong>&nbsp;y mantiene su&nbsp;<strong>portfolio de conocimientos</strong>&nbsp;actualizado. Tambi&eacute;n se preocupa por cuidar la&nbsp;<strong>comunicaci&oacute;n</strong>&nbsp;con todos los implicados en el desarrollo.</p>
<p>Bajando un poco m&aacute;s a nivel t&eacute;cnico, el programador pragm&aacute;tico realiza un&nbsp;<strong>buen dise&ntilde;o de software</strong>. Para conseguir esto, sigue una serie de principios y buenas pr&aacute;cticas, como por ejemplo&nbsp;<em>DRY (Don&rsquo;t Repeat Yourself), Evitar las ventanas rotas, Ortogonalidad, Reversibilidad</em>&nbsp;o&nbsp;<em>desarrollo de Tracer Bullets.</em>&nbsp;Tambi&eacute;n es importante el dominio de las herramientas, como los editores de&nbsp;<em>texto plano</em>&nbsp;(como formato que resiste el paso del tiempo), el&nbsp;<em>debugger</em>&nbsp;y el&nbsp;<em>control de versiones</em>. Algo que siempre me ha llamado la atenci&oacute;n es la recomendaci&oacute;n de llevar un&nbsp;<strong>diario de ingenier&iacute;a</strong>, donde queden registrados, adem&aacute;s de las tareas completadas, los puntos de inter&eacute;s en el proceso de desarrollo (bocetos, m&eacute;tricas, aprendizajes, etc).</p>
<blockquote class="wp-block-quote">
<p><em>Es imposible escribir un software perfecto</em></p>

